const PICTURES_COUNT = 25;
const COUNT_AVATAR = 6;
const MAXIMUM_MESSAGES = 2;
const MAX_LIKES = 200;
const MIN_LIKES = 15;
const MAX_COUNT_UNIQ_ID = 10000;
const MAX_COUNT_COMMENTS = 10;
const DESCRIPTION_INTRODUCTION = [
  'На фотографии мы видим интерестную композицию. ',
  'При первом взгляде на фотографию становится очевидным, что это фиаско. ',
  'Предложенная для описания фотография интересна тем, что удачно подобран фокус. ',
  'Если внимательно посмотреть на снимок, то, что это не годиться. '];
const DESCRIPTION_BASE = [
  'На переднем плане изображены интерестные элементы. ',
  'Если внимательно посмотреть на изображение, то заметим его глубину. ',
  'Композиция снимка весьма интересна, потому что он есть. ',
  'Фото несёт в себе определённое настроение: умиротворенности. '];
const DESCRIPTION_END = [
  'Завершая описание, хочется отметить, что это то, что нужно. ',
  'Своё описание хочется закончить тем, что это совершенно не годиться. ',
  'Нельзя не увидеть талант фотографа, который сумел снять это. ',
];
const MESSAGES_ARRAY = [
  'Всё отлично!',
  'В целом всё неплохо.',
  'Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра.',
  'В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают.',
  'Как можно было поймать такой неудачный момент?!'
];
const NAMES_ARRAY = [
  'Ника', 'Таисия', 'Михаил', 'Евгения', 'Василиса', 'Мария', 'Алиса', 'Илья', 'Иван',
  'Милана', 'Надежда', 'Ксения', 'Амина', 'Николай', 'Кирилл', 'Алексей', 'Руслан',
  'Олег', 'Степан', 'Ульяна', 'Мирослава', 'Андрей', 'Василий', 'Марк', 'София'
];

export {
  PICTURES_COUNT,
  COUNT_AVATAR,
  MAXIMUM_MESSAGES,
  MAX_LIKES,
  MIN_LIKES,
  MAX_COUNT_UNIQ_ID,
  MAX_COUNT_COMMENTS,
  DESCRIPTION_INTRODUCTION,
  DESCRIPTION_BASE,
  DESCRIPTION_END,
  MESSAGES_ARRAY,
  NAMES_ARRAY
};
